jimmywong2003/nrf5-ble-multiple-role-example/ble_app_lbs_nus_c/main.c
        switch (pin_no)
        {
        case LEDBUTTON_BUTTON_PIN:
                // err_code = ble_lbs_led_status_send(&m_ble_lbs_c, button_action);
                // if (err_code != NRF_SUCCESS &&
                //     err_code != BLE_ERROR_INVALID_CONN_HANDLE &&
                //     err_code != NRF_ERROR_INVALID_STATE)
                // {
                //         APP_ERROR_CHECK(err_code);
                // }
                // if (err_code == NRF_SUCCESS)
                // {
                //         NRF_LOG_INFO("LBS write LED state %d", button_action);
                // }
                err_code = led_status_send_to_all(button_action);
                if (err_code == NRF_SUCCESS)
                {
                        NRF_LOG_INFO("LBS write LED state %d", button_action);
                }
                break;

        // case START_CHANEL_SURVERY_START_PIN:
        //         if (button_action == APP_BUTTON_PUSH)
        //         {
        //                 NRF_LOG_INFO("Press the button to start the channel survey");
        //                 err_code = connection_channel_survey_start();
        //                 APP_ERROR_CHECK(err_code);
        //         }
        //         break;
        //
        // case UPDATE_CHANNEL_MAP_PIN:
        //         if (button_action == APP_BUTTON_PUSH)
        //         {
        //                 if (get_channel_map_status())
        //                 {
        //                         channel_map_request_update(m_conn_handle, MINIMUM_CHANNEL_SURVEY_SELECTION);
        //                 }
        //         }
        //         break;
        default:
                APP_ERROR_HANDLER(pin_no);
                break;
        }
}


/**@brief Function for handling Scaning events.
 *
 * @param[in]   p_scan_evt   Scanning event.
 */
static void scan_evt_handler(scan_evt_t const * p_scan_evt)
{
        ret_code_t err_code;

        switch(p_scan_evt->scan_evt_id)
        {
        case NRF_BLE_SCAN_EVT_CONNECTING_ERROR:
                err_code = p_scan_evt->params.connecting_err.err_code;
                APP_ERROR_CHECK(err_code);
                break;

        case NRF_BLE_SCAN_EVT_CONNECTED:
        {
                ble_gap_evt_connected_t const * p_connected =
                        p_scan_evt->params.connected.p_connected;
                // Scan is automatically stopped by the connection.
                NRF_LOG_INFO("Connecting to target 0x%02x%02x%02x%02x%02x%02x",
                             p_connected->peer_addr.addr[0],
                             p_connected->peer_addr.addr[1],
                             p_connected->peer_addr.addr[2],
                             p_connected->peer_addr.addr[3],
                             p_connected->peer_addr.addr[4],
                             p_connected->peer_addr.addr[5]
                             );
        } break;

        case NRF_BLE_SCAN_EVT_SCAN_TIMEOUT:
        {
                NRF_LOG_INFO("Scan timed out.");
                scan_start();
        } break;
        default:
                break;
        }
}



/**@brief Function for initializing the button handler module.
 */
static void buttons_init(void)
{
        ret_code_t err_code;

        //The array must be static because a pointer to it will be saved in the button handler module.
        static app_button_cfg_t buttons[] =
        {
                {LEDBUTTON_BUTTON_PIN, false, BUTTON_PULL, button_event_handler},
                // {START_CHANEL_SURVERY_START_PIN, false, BUTTON_PULL, button_event_handler},
                // {UPDATE_CHANNEL_MAP_PIN, false, BUTTON_PULL, button_event_handler},
        };

        err_code = app_button_init(buttons, ARRAY_SIZE(buttons),
                                   BUTTON_DETECTION_DELAY);
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling database discovery events.
 *
 * @details This function is callback function to handle events from the database discovery module.
 *          Depending on the UUIDs that are discovered, this function should forward the events
 *          to their respective services.
 *
 * @param[in] p_event  Pointer to the database discovery event.
 */
static void db_disc_handler(ble_db_discovery_evt_t * p_evt)
{
        // ble_lbs_on_db_disc_evt(&m_ble_lbs_c, p_evt);
        // ble_nus_c_on_db_disc_evt(&m_ble_nus_c, p_evt);
        NRF_LOG_DEBUG("call to ble_lbs_on_db_disc_evt for instance %d and link 0x%x!",
                      p_evt->conn_handle,
                      p_evt->conn_handle);
        ble_nus_c_on_db_disc_evt(&m_ble_nus_c[p_evt->conn_handle], p_evt);
        ble_lbs_on_db_disc_evt(&m_ble_lbs_c[p_evt->conn_handle], p_evt);
        ble_its_c_on_db_disc_evt(&m_ble_its_c[p_evt->conn_handle], p_evt);
}


/**@brief Database discovery initialization.
 */
static void db_discovery_init(void)
{
        ret_code_t err_code = ble_db_discovery_init(db_disc_handler);
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the log.
 */
static void log_init(void)
{
        ret_code_t err_code = NRF_LOG_INIT(NULL);
        APP_ERROR_CHECK(err_code);

        NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing the timer.
 */
static void timer_init(void)
{
        ret_code_t err_code = app_timer_init();
        APP_ERROR_CHECK(err_code);

}


/**@brief Function for initializing the Power manager. */
static void power_management_init(void)
{
        ret_code_t err_code;
        err_code = nrf_pwr_mgmt_init();
        APP_ERROR_CHECK(err_code);
}


static void scan_init(void)
{
        ret_code_t err_code;
        nrf_ble_scan_init_t init_scan;

        memset(&init_scan, 0, sizeof(init_scan));

        init_scan.connect_if_match = true;
        init_scan.conn_cfg_tag     = APP_BLE_CONN_CFG_TAG;

        err_code = nrf_ble_scan_init(&m_scan, &init_scan, scan_evt_handler);
        APP_ERROR_CHECK(err_code);

        // Setting filters for scanning.
        err_code = nrf_ble_scan_filters_enable(&m_scan, NRF_BLE_SCAN_NAME_FILTER, false);
        APP_ERROR_CHECK(err_code);

